import random

shanbe0 = {
    '6,8':'Varzesh',
    '8,13':'Class',
    '13,14':'Nap',
    '14,16':'Zaban',
    '16,18':'Riazi',
    '18,20':'Class',
    '20,23':'Fizik',
    '23,6':'Z.z.z'
}
shanbe1 = {
    '6,8':'Varzesh',
    '8,13':'Class',
    '13,14':'Nap',
    '14,17':'Riazi',
    '17,18':'Nap',
    '18,20':'Adabiat',
    '20,22':'Shimi',
    '22,6':'Z.z.z'
}
shanbe2 = {
    '6,8':'Varzesh',
    '8,13':'Class',
    '13,14':'Nap',
    '14,17':'Arabi',
    '17,18':'Nap',
    '18,20':'Dini',
    '20,22':'Hendese',
    '22,6':'Z.z.z'
}
shanbe3 = {
    '6,8':'Varzesh',
    '8,13':'Class',
    '13,14':'Nap',
    '14,16':'Zaban',
    '16,17':'Nap',
    '17,20':'Shimi',
    '20,22':'Fizik',
    '22,8':'Z.z.z'
}
shanbe4 = {
    '6,8':'Varzesh',
    '8,13':'Class',
    '13,14':'Nap',
    '14,16':'Arabi',
    '16,18':'Adabiat',
    '18,20':'Class',
    '20,22':'Riazi',
    '22,6':'Z.z.z'
}
shanbe5 = {
    '6,7':'Varzesh',
    '7,9':'Moror(1)',
    '9,11':'Moror(2)',
    '11,12':'Moror(3)',
    '12,14':'Nap',
    '14,18':'Hendese',
    '18,20':'Fizik',
    '20,22':'Riazi',
    '22,6':'Z.z.z'
}
shanbe6 = {
    '6,7':'Varzesh',
    '7,14':'Ghal/Podcast',
    '14,16':'Nap',
    '16,18':'Hendese',
    '18,20':'Riazi',
    '20,21':'Fizik',
    '21,22':'Shimi',
    '0,6':'Z.z.z'
}

qouats_sents=[
    'اگر واقعاً بخواهید کاری انجام دهید، راهی پیدا خواهید کرد.| در غیر این صورت، بهانه ای برای فرار از کارخواهید یافت.',
    'باید مسئولیت کار خود را به عهده بگیرید. شما نمی توانید شرایط، فصل ها یا جهت باد| را تغییر دهید، اما می توانید خود را تغییر دهید. این مسئولیتی است، که به عهده شما است.',
    'یکی از کلید های موفقیت، داشتن نظم در انجام دادن کارهایی است که باید انجام دهید|؛حتی اگر میلی به انجامش ندارید… اما میدانید مهم هستند و باید انجام شوند.',
    'صرفاً مطالب آُسان را مطالعه نکنید. ممکن است با این مطالب سرگرم شوید|، اما هرگز با آن‌ها رشد نخواهید کرد.',
    'راه حل صحیح موفقیت این است که اشتیاق شما به| پیروزی بیشتر از ترس شما از شکست باشد.',
    'جاهایی بروید که مورد توجه واقع شوید، نه مورد تحمل؛اگر آنها ارزش واقعی شما را نمیداند| پس دیگر وقتش است یک شروع جدید در روابطتان داشته باشید.',
    'بهترین انتقام،| یک موفقیت عظیم است.',
    'از همه افرادی که در زندگیم دست رد به سینه ام زندند سپاس گذارم،به همان علت بود| که کارهایم را خودم انجام دادم و الان در این جایگاه قرار دارم',
    'تنها راه انجام دادن کارهای عظیم، دوست داشتن کاری است که میکنید.اگر تا الان آنرا پیدا نکردید|،به گشتنتان ادامه دهید و تا زمانی که آنرا پیدا نکردید، متوقف نشوید',
    'وقتی میگید سخته مترادف جمله “من به قدر کافی قوی نیستم تا براش بجنگم” است، بس کنید| این حرف های مزخرف رو، مثبت باشید و هرچقدر هم سخت باشه، باید بروید بیرون و بدستش بیارید',
    'ترس هایی را که با آنها مواجه نمیشویم| تبدیل به محدودیت های ما میشوند',
    'افراد معمولی با توجه به جایی که الان هستند، تصمیم ‌گیری می‌کنند؛ در حالیکه |افراد موفق بر اساس جایی که قراره بهش برسند،تصمیم‌ می‌گیرند.',
    'میتوانی به خواسته هایت فکر کنی و پیش بروی، یا فقط سختی های راهت را ببینی و تسلیم بشوی،| انتخاب امروز با من و شماست. موفق بودن، می تواند انتخاب هر روز تو باشد.',
    'نیمی از کل مشکلات زندگی ما، ناشی از پاسخ های مثبت |زودهنگام یا پاسخ های منفی دیرهنگام هستند.',
    'بدترین زندان، زندانی است که خود مى‌سازید.| زندان باورها، عادت‌ها، و کوته فکرى‌ها و خرافه‌ها.',
    'برای اندیشیدن زمان صرف کنید ولی وقتی که زمان| عمل فرا رسید دیگر فکر نکنید،عمل کنید.',
    'هیچکس تا به حال برنامه ای برای شکست خوردن، چاق شدن یا احمق بودن ننوشته !| این چیزها وقتی اتفاق می افتد که شما برنامه ای نداشته باشید.',
    '۳ چیز در زندگی که دیگر نمی توانید بدستش آورید : کلمات، بعد از گفته شدن. لحظه ها،| بعد از ازدست دادن. زمان ,بعد از سپری شدن. لطفا هشیار باشید.',
    'اگرچه کسی نمیتواند برگردد به عقب و شروعی عالی داشته باشد،|اما هرکسی میتواند از الان شروع کند و یک پایان عالی داشته باشد.'
    'صرفا چون «متفاوت» یا «خاص» هستین| دلیل نمیشه به درد بخور هم باشین!',
    'اگر چیزی میخواهید که هرگز نداشته اید میبایست کاری انجام دهید |که تاکنون انجام نداده اید و باید فردی شوید که هرگز نبوده اید',
    'من برنده خواهم شد، به دلیل عادت های مثبتی که ساخته ام و به خاطر پافشاری| که در انجام آن عادتها به خرج داده ام',
    'تنها چیزی که نیاز دارید برداشتن قدم های کوچک |متوالی و مصرانه است| تا زندگیتان را بهبود ببخشید',
    'تفاوت بزرگ بین افراد موفق و ناموفق این است که افراد موفق| مشتاق انجام چیزهایی هستند که آدم های ناموفق نیستند',
    'قدم به قدم،روز به روز،تصمیم های شما اعمالتان را شکل میدهند| تا زمانی که به عادت تبدیل شده و ثابت میشوند',
    'وقتی دلیل بزرگی برای انجام یک کار وجود داشته باشد|، هر طور که شده دست به عمل میزنید',
    'یک روتین روزانه که مبتنی بر عادت های خوب و منضبط باشد،| افراد موفق را از بقیه متمایز میکند',
    'همه میتوانند شروع کنند اما فقط افراد| کمی میتوانند به پایان برسانند',
    'ریسک یعنی عمل کردن| بدون قطعیت و اطمینان',
    'روزتان را با سوال “چرا” شروع کنید| بعد با “چه” و “چطور” ادامه دهید',
    'اولین گام برای تغییر ،آگاهی ست.اگر میخواهید از جایی که هستید به جایی بروید که میخواهید،|باید به تصمیماتی که شما را  به مقصد اصلیتان هدایت میکند آگاه باشید',
    'آموزش های دانشگاهی به یافتن راهی برای تأمین مخارج زندگی کمک می‌کند،| اما آموزش های شخصی و توسعه فردی برای شما ثروت تولید می‌کند'

]

Test_Jt = {
    'H' : (1,'هیدروژن'),
    'He': (2,'هلیم'),
    'Li': (3,'لیتیم'),
    'Be': (4,'برلیم'),
    'B' : (5,'بور'),
    'C' : (6,'کربن'),
    'N' : (7,'نوترون'),
    'O' : (8,'اکسیژن'),
    'F' : (9,'فلوئور'),
    'Ne': (10,'نئون'),
    'Na': (11,'سدیم'),
    'Mg': (12,'منیزیم'),
    'Al': (13,'الومینیوم'),
    'Si': (14,'سیلیسیم'),
    'P' : (15,'فسفر'),
    'S' : (16,'گوگرد'),
    'Cl': (17,'کلر'),
    'Ar': (18,'ارگون'),
    'K' : (19,'پتاسیم'),
    'Ca': (20,'کلسیم'),
    'Sc': (21,'اسکاندیم'),
    'Ti': (22,'تیتانیم'),
    'V' : (23,'وانادیم'),
    'Cr': (24,'کروم'),
    'Mn': (25,'منگنز'),
    'Fe': (26,'اهن'),
    'Co': (27,'کبالت'),
    'Ni': (28,'نیکل'),
    'Cu': (29,'مس'),
    'Zn': (30,'روی'),
    'Ga': (31,'گالیم'),
    'Ge': (32,'ژرمانیم'),
    'As': (33,'ارسنیک'),
    'Se': (34,'سلنیم'),
    'Br': (35,'برم'),
    'Kr': (36,'کریپتون'),
    'Rb': (37,'روبیدیم'),
    'Sr': (38,'استرانسیم')
}
def give_random_Onsor():
    list_inde = list(Test_Jt)[random.randint(0,37)]
    return (list_inde,Test_Jt[list_inde])

kalamat_adabiat_dars1={
"غلغله زن":"شور و غوغا کنان",
"تیزپا":"تندرو/تیزرو",
"چهره نما":"نشان دهندهی چهره/زلال/خودنما",
"معرکه":"میدان جنگ/جای نبرد",
"گلبن":"بوته یا درخت گل",
"شِکن":"پیچ و خم زلف/شکستن/چین و چروک",
"دمیدن":["روییدن/سر بر اوردن گیاه از زمین",'فوت کردن/طلوع کردن/فریب دادن'],
"تابناک":"روشن/درخشنده",
"بر":["شور و غوغا کنان","آغوش/سینه/نفع و سود/بیابان و خشکی"],
"گریبان":"یقه/پنهان شدن",
"خجلی":"خجالت",
"پیرایه":"زیور و زینت",
"برازندگی":"لیاقت/شایستگی",
"نیلوفری":"رنگ اسمانی/لاجوردی",
"نمط":"روش/طریقه",
"زین نمط":"بدین طرطیب",
"بحر":"دریا",
"زهره در":"کنایه از هرس اور",
"یله":"رها",
"یله دادن ":"تکیه دادن",
"هنگامه":"غوغا/داد و فریاد",
"ورطه":"گرداب/گودال/مهلکه",
"خیره":"سر گشته/حیران/فرومانده",
"هوش دار":"مراقب باش",
"تفرج":"سیر و تماشا/گردش",
"جادو":"ساحره/افسونگر",
}

dictk_jt = {
    'Goroh_1':['h','li','na','k','rb','cs','fr'],
    'Goroh_2':['br','mg','ca','sr','ba','ra'],
    'Goroh_13':['b','al','ga','in','tl','nh'],
    'Goroh_14':['c','si','ge','sn','pb','fl'],
    'Goroh_15':['n','p','as','sb','bi','mc'],
    'Goroh_16':['o','s','se','te','po','lv'],
    'Goroh_17':['f','cl','br','i','at','ts'],
    'Goroh_18':['he','ne','ar','kr','xe','rn','og'],
    'Tanavob_4':['k','ca','sc','ti','v','cr','mn','fe','co','ni','cu','zn','ga','ge','as','se','br','kr']
}
def give_random_column():
    dictk= list(dictk_jt.keys())[random.randint(0,8)]
    return (dictk,dictk_jt[dictk])