from PIL import Image,ImageTk
from tkinter import *
images_mode1 = {
    #Main

'main' : 'Assests\\Mode1\\Main\\main(mode1).png',
'profile' : 'Assests\\Mode1\\Main\\Profile(mode1).png',
'learn' : 'Assests\\Mode1\\Main\\Learn(mode1).png',
'game' : 'Assests\\Mode1\\Main\\Game(mode1).png',

    # Game
'game_wallpaper' : 'Assests\\Mode1\\Game\\WallPaper.png',
'game_exit' : 'Assests\\Mode1\\Game\\Exit.png',
'game_next' : 'Assests\\Mode1\\Game\\Next.png',
'game_previous' : 'Assests\\Mode1\\Game\\Previous.png',
'game_l2' : 'Assests\\Mode1\\Game\\Layer2.png',
'test':'Assests\\Mode1\\Game\\text.png',
'test2':'Assests\\Mode1\\Game\\test 2.png',
'test3':'Assests\\Mode1\\Game\\test 3.png',
'test4':'Assests\\Mode1\\Game\\test 4.png',
'test5':'Assests\\Mode1\\Game\\test 5.png',

    # Learn
'learn_wallpaper' : 'Assests\\Mode1\\Learn\\wallPaper.png',
'profile_layer_2' : 'Assests\\Mode1\\Learn\\back.png',
    
    
    # Profile
'profile_frame' : 'Assests\\Mode1\\Profile\\Frame.png',
'profile_wallpaper': 'Assests\\Mode1\\Profile\\Wallpaper.png',
'profile_exit': 'Assests\\Mode1\\Profile\\Back.png',
'profile_bio_edit': 'Assests\\Mode1\\Profile\\Edit_Bio.png',
'profile_bio_edit': 'Assests\\Mode1\\Profile\\Edit_Bio.png',
'profile_blank': 'Assests\\Mode1\\Profile\\blank.png',


    #Apps
'app_editbio': 'Assests\\Mode1\\Apps\\Profile_edit.png',
'app_searchprofile': 'Assests\\Mode1\\Apps\\Profile_Explore.png',
'app_chemestry':'Assests\\Mode1\\Apps\\Chemestry.png',






}
images_mode2 = {




}

Chem_Tarkib_Ha = {
    'CH4':('متان',('سبک ترین هیدرو کربن ( آلکان','بیرنگ','بی بو','گازي شکل','آتش گیر','از واکنش زغال سنگ با بخار اب داغ تهیه میشود','در گاز شهري وجود دارد')),
    'C2H4':('اتن ( اتیلن )',('ساده ترین عضو آلکن هاست ( هیدرو کربن سیر نشده)','در بسیاری از گیاهان به صورت ماده هورمون مانند است و موجب رسیدن میوه ها میشود','به عنوان مونومردر ساخت پلی اتیلن به کار می رود')),
    'C2H2':('اتین ( استیلن )','ساده ترین عضو آلکین هاست ( سیر نشده)','در جوشکاری و برشکاری کاربرد دارد','واکنش پذیری بیشتری نسبت به اتن و اتان دارد','از واکنش کلسیم کاربید با آب توسط فردریک ولر تهیه شد'),
    'CCl4':('کربن تترا کلرید',('حلال ترکیب هاي ناقطبی است ( مانند ید )')),
    'C2H6O':('دي متیل اتر',('ساده ترین عضو خانواده ا تر هاست','ماده ای بی بو و بیهوش کننده است','پیشران در افشانه ها و گاز یخچال')),
    'C4H10O':('دي اتیل اتر',('عضودوم خانواده اتر هاست','مایعی بیرنگ و فراور و اتشگیر است','در گذشته به عنوان بیهوش کننده کاربرد داشت','به دلیل اثار نا مطلوب روی مجرای تنفسی از ان استفاده میشود')),
    'C2H4O':('اتانول',('دومین عضو از خانواده آلدهید هاست')),
    'C2H2O':('کتن',('یک نوع مشتق هیدروکربن سیر نشده است')),
    'Cl2':('کلر',('گازي سمی و خورنده و واکنش پذیر است','از واکنش HCL قوی با منگنز(IV) اکسید تولید میشود')),
    'CaC2':('کلسیم کاربید',('با گرم کردن کربن با آلیاژي از روي و کلسیم توسط فردریک ولر به دست امد','از واکنش آن با آب گاز استیلن ( اتین ) تولید می شود')),
    'C6H6':('بنزن',('ساده ترین عضو ترکیبات آلی سیر نشده آروماتیک است','مایعی بیرنگ','فرار و با شعله زرد همراه دوده می سوزد',' در نفت خام و قطران زغال سنگ وجود دارد و به علت سرطان زا بودن استفاده از آن ممنوع شده است')),
    'C10H8':('نفتالن',('ترکیب آلی آروماتیک دو حلقه اي است','به عنوان ضد بید در نگاهداري فرش و لباس کاربرد دارد')),
    'C6H6O':('فنول',('ترکیب آلی آروماتیک از مشتقات بنزن است','جامودی سفید رنگ و به صورت بلوري به رنگ صورتی یا سرخ دیده می شود سمی بوده','در قطران زغال سنگ','در تولید آسپرین و رنگ نساجی و گندزدایی بیمارستان ها به کار میرود')),
    'CH3OH':('متانول ( متیل الکل )',('الکل چوب','در غیاب اکسیژن از گرم کردن چوب تا دماي 400 درجه به حالت بخار به دست می آید-','به عنوان حلال و تولید مواد شیمیایی در صنعت و سوخت تمیز در برخی کشور ها می باشد','از واکنش گاز CO , H2 نیز تولید میشود','به هر نسبتی در اب حل میشود')),
    'C2H6O':('اتانول ( اتیل الکل )',('الکل میوه','بر اثر تخمیر قند ها وکربو هیدرات هاي موجود در مواد غذایی به دست می آید','پس از آب مهم ترین حلال صنعتی است','بیرنگ و فرار و در آب به هر نسبتی حل میشود','برای ضد عفونی ضخم ها و تولید مواد دارویی و آرایشی و بهداشتی کاربرد دارد')),
    'C2H6O2':('اتیلن گلیکول',('الکل دو عاملی است','به عنوان ضد یخ کاربرد دارد')),
    'C3H8O3':('گلیسیرین',('الکل سه عاملی است','درتولید اسید چرب','نرم کنندهدر مواد شوینده و آرایشی بهداشتی به کار می رود.')),
    'NH4NO3':('آمونیوم نیترات',('در تهیه کود هاي شیمیایی کاربرد دارند')),
    '(NH4)2SO4':('آمونیوم سولفات',('در تهیه کود هاي شیمیایی کاربرد دارند')),
    'Li2O2':('لیتیم پر اکسید',('براي تصفیه هواي درون فضاپیماها استفاده می شوند .')),
    'LiOH':('لیتیم هیدروکسید',('براي تصفیه هواي درون فضاپیماها استفاده می شوند .')),
    'AgBr':('نقره برمید',('در تهیه فیلم عکاسی کاربرد دارد')),
    'SnF2':('قلع(II)فلوئورید',('در خمیر پرکننده دندان کاربرد دارد')),
    'Si':('سیلیسیم خالص',('در تراشه هاي الکترونیکی و سلول هاي خورشید ي کاربرد دارد','از واکنش SiCl4 و Mg بسیار خالص تولید میشود')),
    'NaN3':('سدیم آزید',('از تجزیه آن در کیسه هاي هواي خودرو ها گاز نیتروژن آزاد می شود')),
    'Fe2O3':('آهن(III) اکسید',('براي خنثی کردن اثر سدیم فلزي حاصل از تجزیه سدیم آزید در کیسه هواي خودرو ها و گرماي حاصل از واکنش آن با سدیم براي انبساط کیسه.',)),
    'C3H5(NO3)3':('نیترو گلیسیرین',('ماده منفجره بسیار حساس است')),
    'C6H14':('هگزان',('آلکان 6 کربنه ناقطبی است','مایعی بیرنگ و فرار','ازنفت خام به دست می اید','حلال ترکیبات ناقطبی','به عنوان رقیق کننده تیتر در رنگ هاي پوششی کاربرد دارد')),
    'C20H30O':(' ویتامین A(رتینول)',('هیدروکربن سیر نشده')),
    'C6H8O6':('ویتامین C(اسکوربیک اسید)',('جامدي سفید رنگ','غیر سمی و محلول در آب','مقاومت بدن را در برابر عفونت ها زیاد میکند',)),
    'CaCl2':('کلسیم کلرید',('به عنوان نم گیر و در بسته هاي تولید کننده گرما کاربرد دارد')),
    'SO2Cl2':('سولفوریل کلرید',('از تجزیه ی ان گاز های Cl2,SO3 تولید میشود')),
    'H2O2':('هیدروژن پراکسید(آب اکسیژنه)',('در رنگرزي مو ، کاغذ و پارچه کاربرد دارد')),
    'H2':('گاز هیدروژن',('از پالایش نفت خام و از طریق عبور بخار آب از روي زغال داغ به دست می اید','براي تولید آمونیاك در فر آیند هابر به کار می رود')),
    'N2':('از نیتروژن',('از تقطیر هواي مایع به دست می آید. بر اي تولید آمونیاك به کار می رود')),
    'NH3':('آمونیاك',('در تهیه کود شیمیایی و مواد منفجره و مواد شیمیایی صنعتی کاربرد دارد','در صنعت آمونیاك را در دماي 450 و فشار 150 تا 350 اتمسفر در مجاورت اهن و MgO و Al2O3 از H2 و N2 به دست می اید')),
    'H2SO4':('سولفوریک اسید',('جوهر گوگرد','اسید باتري خودرو')),
    'H3PO4':('فسفریک اسید',('ماده افزودنی در نوشابه گاز دار','تولید کود شیمیایی','پاک کنندهی صابونی و غیر صابونی','تصفیه ی اب','خوراك دام و داروسازي')),
    'NaOH':('سدیم هیدروکسید',('معروف به سود سوز آور','باز قوي می باشد','در تهیه صابون جامد و ابریشم مصنوعی و باز کردن مجراي فاضلاب ها')),
    'KOH':('پتاسیم هیدروکسید',('معروف به پتاس سوز آور','یک باز قوي است','در تهیه صابون مایع و باتري قلیایی')),
    'Mg(OH)2':('منیزیم هیدروکسید',('خنثی کننده اسید معده','شیر منیزي','نا محلول',)),
}